Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, None, 20)          12101440  
_________________________________________________________________
global_average_pooling1d (Gl (None, 20)                0         
_________________________________________________________________
activation (Activation)      (None, 20)                0         
_________________________________________________________________
dense (Dense)                (None, 128)               2688      
_________________________________________________________________
activation_1 (Activation)    (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
activation_3 (Activation)    (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 132       
_________________________________________________________________
activation_4 (Activation)    (None, 4)                 0         
=================================================================
Total params: 12,114,596
Trainable params: 12,114,596
Non-trainable params: 0
_________________________________________________________________





Model: "cnn_classification_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        multiple                  12101440  
_________________________________________________________________
conv1d (Conv1D)              multiple                  1952      
_________________________________________________________________
conv1d_1 (Conv1D)            multiple                  6208      
_________________________________________________________________
conv1d_2 (Conv1D)            multiple                  24704     
_________________________________________________________________
max_pooling1d (MaxPooling1D) multiple                  0         
_________________________________________________________________
global_max_pooling1d (Global multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  516       
=================================================================
Total params: 12,134,820
Trainable params: 12,134,820
Non-trainable params: 0











